app/controllers/projects_controller.rb

SELECT "categories".* FROM "categories"
SELECT "projects".* FROM "projects" ORDER BY project_date desc
---
  def index
    @categories = Category.all
    @projects = Project.all.order("project_date desc")

SELECT "categories".* FROM "categories"
---
  def new
    @project = Project.new
    @categories = Category.all

INSERT INTO "projects" ("title", "client", "display_category", "project_date", "url", "description", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "categories".* FROM "categories"
---
  def create
    @project = Project.new(project_params)
    @project.category_id = params["category"]["category_id"]
    @project.images = params[:project_images]
    if @project.save
      redirect_to root_path
    else
      @categories = Category.all

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def find_project
    @project = Project.find(params[:id])